app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "post wthout relation"], ["body", "This post don't have an user relationship"], ["created_at", "2015-10-01 18:30:24.105914"], ["updated_at", "2015-10-01 18:30:24.105914"]]
---
  def create
    @post = current_user.posts.build(post_params)
    respond_to do |format|
      if @post.save