app/controllers/users_controller.rb

def show
  @users = User.all.paginate(page: params[:page], :per_page => 6).order('created_at DESC')
  @user = User.find(params[:id])
  @user_posts = @user.posts.paginate(page: params[:page], :per_page => 6).order('created_at DESC')
  @users_following = @user.following.paginate(page: params[:page], :per_page => 6).order('created_at DESC')
  @users_followers = @user.followers.paginate(page: params[:page], :per_page => 6).order('created_at DESC')
  @feed_items = @user.feed.paginate(page: params[:page], :per_page => 6)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" LIMIT 1